In [39]:
# Import Libraries 
import pandas as pd 
import numpy as np 
import numpy
import matplotlib.pyplot as plt

%matplotlib inline
import plotly
import plotly.express as ex
import plotly.graph_objs as go
from pathlib import Path
from sqlalchemy import extract
from sqlalchemy import create_engine
import psycopg2

#from config import db_password
from config import ro_pass

import time
from time import ctime

from sklearn.model_selection import train_test_split,cross_val_score,RepeatedStratifiedKFold
from sklearn.preprocessing import LabelEncoder,MinMaxScaler,StandardScaler

from sklearn.ensemble import GradientBoostingClassifier,RandomForestClassifier
from sklearn.metrics import confusion_matrix, accuracy_score, classification_report
#from sklearn.metrics import accuracy_score

from pathlib import Path
from collections import Counter

import warnings
warnings.filterwarnings('ignore')

In [2]:
# dbname
dbname='happyhour'

# users
ro_user='happyhour_ro1'

# connection strings
ro_string = f"postgresql://{ro_user}:{ro_pass}@postgress-1.caahnjhin4st.us-east-1.rds.amazonaws.com/{dbname}"

# Muhammad's PC caught fire (yes, really)
# This is a backup in Random Forest Model (for segment 3)
# More extensive updates to come

In [51]:
# Create engine and read in data from Postgres
engine = create_engine(ro_string)

model_input = pd.read_sql_table('train', engine, index_col='PassengerId')

In [52]:
model_input

,Survived,Pclass,Sex,Age,Fare,Embarked_Q,Embarked_S,"fare_group_(7.854, 10.5]","fare_group_(10.5, 21.679]","fare_group_(21.679, 39.688]","fare_group_(39.688, 512.329]",title,total
PassengerId,,,,,,,,,,,,,
1,0,3,0,22.00000,2.692582,0,1,0,0,0,0,1,1
2,1,1,1,38.00000,8.442944,0,0,0,0,0,1,2,1
3,1,3,1,26.00000,2.815138,0,1,1,0,0,0,3,0
4,1,1,1,35.00000,7.286975,0,1,0,0,0,1,2,1
5,0,3,0,35.00000,2.837252,0,1,1,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,0,27.00000,3.605551,0,1,0,1,0,0,5,0
888,1,1,1,19.00000,5.477226,0,1,0,0,1,0,3,0
889,0,3,1,25.14062,4.842520,0,1,0,0,1,0,3,3
890,1,1,0,26.00000,5.477226,0,0,0,0,1,0,1,0
891,0,3,0,32.00000,2.783882,1,0,0,0,0,0,1,0

In [ ]:
# Simplify model for initial run.

In [53]:
model_input.drop(['Embarked_Q', 'Embarked_S', 'title', 'total'], inplace=True, axis=1)

In [54]:
model_input.drop(['fare_group_(7.854, 10.5]', 'fare_group_(10.5, 21.679]',
                  'fare_group_(21.679, 39.688]', 'fare_group_(39.688, 512.329]'],
                inplace=True, axis=1)

In [56]:
model_input.head()

             Survived  Pclass  Sex   Age      Fare
PassengerId
1                   0       3    0  22.0  2.692582
2                   1       1    1  38.0  8.442944
3                   1       3    1  26.0  2.815138
4                   1       1    1  35.0  7.286975
5                   0       3    0  35.0  2.837252

In [57]:
# generate test/ training set
# Drop 'Survived' column  from train
x_train,x_test,y_train,y_test=train_test_split(model_input.drop('Survived',axis=1),model_input['Survived'],test_size=.2)

In [58]:
x_train.head()

             Pclass  Sex       Age       Fare
PassengerId
287               3    0  30.00000   3.082207
471               3    0  25.14062   2.692582
721               2    1   6.00000   5.744563
517               2    1  34.00000   3.240370
499               1    1  25.00000  12.310565

In [59]:
y_train.head()

PassengerId
287    1
471    0
721    1
517    1
499    0
Name: Survived, dtype: int64

In [60]:
x_test.head()

             Pclass  Sex       Age       Fare
PassengerId
699               1    0  49.00000  10.530114
54                2    1  29.00000   5.099020
452               3    0  25.14062   4.468411
775               2    1  54.00000   4.795832
37                3    0  25.14062   2.688717

In [61]:
y_test.head()

PassengerId
699    0
54     1
452    0
775    1
37     1
Name: Survived, dtype: int64

In [62]:
# Creating StandardScaler instance
scaler = StandardScaler()

In [63]:
# Fitting Standard Scaller
x_scaler = scaler.fit(x_train)

In [64]:
# Scaling the data
x_train_scaled = x_scaler.transform(x_train)
x_test_scaled = x_scaler.transform(x_test)

In [65]:
# Create an initial random forest classifier (use n_estimators=128 as starting point)
rf_model = RandomForestClassifier(n_estimators=128, random_state=78)

In [66]:
# Fitting the model
rf_model = rf_model.fit(x_train_scaled, y_train)

In [67]:
# Making predictions using the testing data.
predictions = rf_model.predict(x_test_scaled)

In [68]:
# Calculating the confusion matrix.
cm = confusion_matrix(y_test, predictions)

# Create a DataFrame from the confusion matrix.
cm_df = pd.DataFrame(
    cm, index=["Actual 0", "Actual 1"], columns=["Predicted 0", "Predicted 1"])

cm_df

          Predicted 0  Predicted 1
Actual 0          102           16
Actual 1           13           48

In [69]:
# Calculating the accuracy score.
acc_score = accuracy_score(y_test, predictions)
acc_score

0.8379888268156425

In [72]:
# Displaying results
print("Initial Random Forest Model Results for Titanic Surviors\n")
print("Confusion Matrix")
display(cm_df)
print(f"\nAccuracy Score : {acc_score}\n")
print("Classification Report")
print(classification_report(y_test, predictions))

Initial Random Forest Model Results for Titanic Surviors

Confusion Matrix

          Predicted 0  Predicted 1
Actual 0          102           16
Actual 1           13           48

Accuracy Score : 0.8379888268156425

Classification Report
              precision    recall  f1-score   support

           0       0.89      0.86      0.88       118
           1       0.75      0.79      0.77        61

    accuracy                           0.84       179
   macro avg       0.82      0.83      0.82       179
weighted avg       0.84      0.84      0.84       179

In [71]:
# Sort and list the features by their importance.
sorted(zip(rf_model.feature_importances_, x_train.columns), reverse=True)

[(0.3385106658405846, 'Fare'),
 (0.2924776311943599, 'Age'),
 (0.2662723931813797, 'Sex'),
 (0.10273930978367589, 'Pclass')]